---
kind: property
id: P:Autodesk.Revit.DB.Face.Area
zh: 面积区域
source: html/e851e3f0-799f-c071-c3c6-18d7e50c9914.htm
---
# Autodesk.Revit.DB.Face.Area Property

**中文**: 面积区域

The area of this face.

## Syntax (C#)
```csharp
public double Area { get; }
```

## Remarks
Returns zero if fails to compute the area. In some cases, this area may be estimated.